gs-consuming-web-service/src/main/resources/NewFile.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<ns2:getCountryRequest
			xmlns:ns2="http://spring.io/guides/gs-producing-web-service">
			<ns2:name>Spain</ns2:name>
		</ns2:getCountryRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

